{
  "items": [
    {
      "dua": "رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِنْ لَدُنْكَ رَحْمَةً ۚ إِنَّكَ أَنْتَ الْوَهَّابُ",
      "transliteration": "Rabbana la tuzigh qulubana ba'da idh hadaytana wa hab lana milladunka rahmah innaka antal Wahhab.",
      "translation": "Our Lord, do not let our hearts deviate after You have guided us, and grant us mercy from Your own presence. You are the Bestower.",
      "source": "Quran 3:8"
    },
    {
      "dua": "اللَّهُمَّ اغْفِرْ لِي ذَنْبِي وَوَسِّعْ لِي فِي دَارِي وَبَارِكْ لِي فِي رِزْقِي",
      "transliteration": "Allahumma-ghfirli dhambi wa wasi'li fi dari wa barik li fi rizqi.",
      "translation": "O Allah, forgive my sins, expand my living space, and bless my provisions.",
      "source": "Sunan Ibn Majah, Book 5, Hadith 3834"
    },
    {
      "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الثَّبَاتَ فِي الْأَمْرِ، وَالْعَزِيمَةَ عَلَى الرُّشْدِ، وَأَسْأَلُكَ مِنْ خَيْرِ مَا تَعْلَمُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا تَعْلَمُ، وَأَسْتَغْفِرُكَ لِمَا تَعْلَمُ، إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ",
      "transliteration": "Allahumma inni as'alukath-thabata fil-amri, wal-'azimata 'alar-rushd, wa as'alukaminkhayri ma ta'lamu, wa a'udhubika min sharri ma ta'lamu, wa astaghfiruka lima ta'lamu, innaka anta 'allamul-ghuyub.",
      "translation": "O Allah, I ask You for firmness in affairs, determination in guidance, and I ask You for the best of what You know, and I seek refuge in You from the evil of what You know, and I seek Your forgiveness for what You know. Indeed, You are the Knower of the unseen.",
      "source": "Sunan Ibn Majah, Book 14, Hadith 3884"
    },
    {
      "dua": "اللَّهُمَّ اجْعَلْنِي مِنَ التَّوَّابِينَ وَاجْعَلْنِي مِنَ الْمُتَطَهِّرِينَ",
      "transliteration": "Allahumma-j'alni minat-tawwabina waj'alni minal-mutatahhirin.",
      "translation": "O Allah, make me among those who constantly repent and purify themselves.",
      "source": "Sunan Ibn Majah, Book 5, Hadith 1520"
    },
    {
      "dua": "رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِنْ لَدُنْكَ رَحْمَةً إِنَّكَ أَنْتَ الْوَهَّابُ",
      "transliteration": "Rabbana la tuzigh quloobana ba'da idh hadaytana wa hab lana min ladunka rahmah innaka anta-lwahhab.",
      "translation": "Our Lord, do not let our hearts deviate after You have guided us, and grant us mercy from Your presence. Indeed, You are the Bestower.",
      "source": "The Quran, Surah Ali 'Imran, Verse 8"
    },
    {
      "dua": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ",
      "transliteration": "Allahumma inni a'udhu bika min 'adhabi-l-qabr, wa a'udhu bika min fitnati-l-mahya wa-l-mamat.",
      "translation": "O Allah, I seek refuge in You from the punishment of the grave, and I seek refuge in You from the trials of life and death.",
      "source": "Sahih Muslim, Book 40, Hadith 2867"
    },
    {
      "dua": "رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ",
      "transliteration": "Rabbana ighfir li waliwalidayya walilmu'mineena yawma yaqumul hisab.",
      "translation": "Our Lord, forgive me and my parents and the believers on the Day when the account is established.",
      "source": "The Quran, Surah Ibrahim, Verse 41"
    },
    {
      "dua": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ، وَتَحَوُّلِ عَافِيَتِكَ، وَفُجَاءَةِ نِقْمَتِكَ، وَجَمِيعِ سَخَطِكَ",
      "transliteration": "Allahumma inni a'udhu bika min zawali ni'matik, wa tahawwuli 'afiyatik, wa fuja'ati niqmatik, wa jami'i sakhatik.",
      "translation": "O Allah, I seek refuge in You from the disappearance of Your blessings, the transformation of Your favors, the suddenness of Your punishment, and from all Your wrath.",
      "source": "Sahih Muslim, Book 17, Hadith 1483"
    },
    {
      "dua": "رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا",
      "transliteration": "Rabbana hablana min azwajina wa dhurriyyatina qurrata a'yunin wa-j'alna lil-muttaqina imama.",
      "translation": "Our Lord, grant us from among our wives and offspring comfort to our eyes and make us an example for the righteous.",
      "source": "The Quran, Surah Al-Furqan, Verse 74"
    },
    {
      "dua": "اللهُمَّ اغْفِرْ لِي وَارْحَمْنِي وَعَافِنِي وَارْزُقْنِي",
      "transliteration": "Allahumma ighfir li warhamni wa 'afini wa arzuqni.",
      "translation": "O Allah, forgive me, have mercy on me, protect me, and provide for me.",
      "source": "Tirmidhi, Book 35, Hadith 3382"
    },
    {
      "dua": "اللهُمَّ اجْعَلْنِي مِنَ التَّوَّابِينَ وَاجْعَلْنِي مِنَ الْمُتَطَهِّرِينَ",
      "transliteration": "Allahumma ij'alni minat-tawwabina waj'alni minal-mutatahhirin.",
      "translation": "O Allah, make me among those who repent and make me among those who purify themselves.",
      "source": "The Quran, Surah Al-Baqarah, Verse 128"
    },
    {
      "dua": "سُبْحَانَ اللهِ وَبِحَمْدِهِ",
      "transliteration": "SubhanAllah wa bihamdihi",
      "translation": "Glory be to Allah and all praise is due to Him.",
      "source": "Sahih Bukhari, Book 97, Hadith 50"
    },
    {
      "dua": "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيمِ",
      "transliteration": "Bismillah ar-Rahman ar-Raheem",
      "translation": "In the name of Allah, the Most Gracious, the Most Merciful.",
      "source": "The Quran, Surah Al-Fatihah, Verse 1"
    },
    {
      "dua": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لَا يَنْفَعُ وَمِنْ قَلْبٍ لَا يَخْشَعُ وَمِنْ نَفْسٍ لَا تَشْبَعُ وَمِنْ دُعَاءٍ لَا يُسْتَجَابُ لَهُ",
      "transliteration": "Allahumma inni a'udhu bika min ilmin la yanfa'u wa min qalbin la yakhsha'u wa min nafsin la tashba'u wa min dua'in la yustajabu lahu.",
      "translation": "O Allah, I seek refuge in You from knowledge that does not benefit, from a heart that does not fear (You), from a soul that is never satisfied, and from a prayer that is not answered.",
      "source": "Muslim, Book 4, Hadith 1392"
    },
    {
      "dua": "اللَّهُمَّ إِنَّا نَسْأَلُكَ الْجَنَّةَ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ وَنَعُوذُ بِكَ مِنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ وَنَسْتَغْفِرُكَ وَنَتُوبُ إِلَيْكَ",
      "transliteration": "Allahumma innana nas'aluka aljannah wa ma qarrab ilayha min qawlin aw amalin, wa na'udhu bika min al-nar wa ma qarrab ilayha min qawlin aw amalin, wa nastaghfiruka wa natubu ilayka.",
      "translation": "O Allah, we ask You for Paradise and that which brings us closer to it from speech and action. And we seek refuge in You from the Fire and that which brings us closer to it from speech and action. And we seek Your forgiveness and we repent to You.",
      "source": "Sunan Ibn Majah, Book 5, Hadith 3876"
    },
    {
      "dua": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لَا يَنْفَعُ وَمِنْ قَلْبٍ لَا يَخْشَعُ وَمِنْ نَفْسٍ لَا تَشْبَعُ وَمِنْ دُعَاءٍ لَا يُسْتَجَابُ لَهُ",
      "transliteration": "Allahumma inni a'udhu bika min ilmin la yanfa'u wa min qalbin la yakhsha'u wa min nafsin la tashba'u wa min dua'in la yustajabu lahu.",
      "translation": "O Allah, I seek refuge in You from knowledge that does not benefit, from a heart that does not fear (You), from a soul that is never satisfied, and from a prayer that is not answered.",
      "source": "Muslim, Book 4, Hadith 1392"
    },
    {
      "dua": "اللَّهُمَّ لَا سَهْلَ إِلَّا مَا جَعَلْتَهُ سَهْلًا وَأَنْتَ تَجْعَلُ الْحَزْنَ إِذَا شِئْتَ سَهْلًا",
      "transliteration": "Allahumma la sahla illa ma ja'altahu sahlan, wa anta taj'alul hazna idha shi'ta sahlan.",
      "translation": "O Allah, nothing is easy except what You make easy, and You can make the difficult easy if You will.",
      "source": "Ibn Hibban, Hadith 2427"
    },
    {
      "dua": "رَبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ وَأَعُوذُ بِكَ رَبِّ أَنْ يَحْضُرُونِ",
      "transliteration": "Rabbii a'udhu bika min hamazatish-shayateeni wa a'udhu bika rabbi an yahdharun.",
      "translation": "O Lord, I seek refuge in You from the whispers of the devils, and I seek refuge in You, O Lord, from their presence.",
      "source": "Surah Al-Mu'minun, 23:97-98"
    }
  ]
}